Revit 2027 API
CurveOverlapPointType Enumeration
 An enumeration characterizing a point shared by two curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CurveOverlapPointType
Public Enumeration CurveOverlapPointType
public enum class CurveOverlapPointType
type CurveOverlapPointType
Members
Member name | Value | Description
Intersection | 1 |  The point marks a transverse intersection of the two curves.
IntervalEnd | 3 |  The point marks the end of an interval over which the two curves overlap.
IntervalStart | 2 |  The point marks the beginning of an interval over which the two curves overlap.
Uninitialized | 0 |  The value is uninitialized.
See Also
Reference
Autodesk.Revit.DB Namespace